#### Terraform Workspace 📖`production`
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

terraform
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.tf-aws-network.data.aws_availability_zones.az: Reading...[0m[0m
[0m[1mmodule.tf-aws-network.aws_vpc.vpc: Refreshing state... [id=vpc-0c4d6fd51aea11078][0m
[0m[1mmodule.tf-aws-network.data.aws_availability_zones.az: Read complete after 1s [id=eu-west-1][0m
[0m[1mmodule.tf-aws-network.aws_security_group.lb-security-group: Refreshing state... [id=sg-048cf8e55ba9fd02c][0m
[0m[1mmodule.tf-aws-network.aws_internet_gateway.internet-gateway: Refreshing state... [id=igw-047dca0a069011a29][0m
[0m[1mmodule.tf-aws-network.aws_subnet.web[0]: Refreshing state... [id=subnet-0bdaf07c2f06ac225][0m
[0m[1mmodule.tf-aws-network.aws_subnet.web[1]: Refreshing state... [id=subnet-00cbfefe866668f25][0m
[0m[1mmodule.tf-aws-network.aws_security_group.web-security-group: Refreshing state... [id=sg-06d7bac7cfe77fa20][0m
[0m[1mmodule.tf-aws-network.aws_route_table.web-rt: Refreshing state... [id=rtb-022071f7985427058][0m
[0m[1mmodule.tf-aws-network.aws_security_group.db-security-group: Refreshing state... [id=sg-090f60a36355073e3][0m
[0m[1mmodule.tf-aws-network.aws_route_table_association.web[0]: Refreshing state... [id=rtbassoc-01f8262371c9a2df0][0m
[0m[1mmodule.tf-aws-network.aws_route_table_association.web[1]: Refreshing state... [id=rtbassoc-0d07f1d8299f3e12f][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.tf-aws-web-tier.aws_autoscaling_attachment.web-atg-tg-att[0m will be created
[0m  [32m+[0m[0m resource "aws_autoscaling_attachment" "web-atg-tg-att" {
      [32m+[0m[0m autoscaling_group_name = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m lb_target_group_arn    = (known after apply)
    }

[1m  # module.tf-aws-web-tier.aws_autoscaling_group.web-asg[0m will be created
[0m  [32m+[0m[0m resource "aws_autoscaling_group" "web-asg" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m availability_zones        = (known after apply)
      [32m+[0m[0m default_cooldown          = (known after apply)
      [32m+[0m[0m desired_capacity          = 2
      [32m+[0m[0m force_delete              = false
      [32m+[0m[0m force_delete_warm_pool    = false
      [32m+[0m[0m health_check_grace_period = 300
      [32m+[0m[0m health_check_type         = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m load_balancers            = (known after apply)
      [32m+[0m[0m max_size                  = 4
      [32m+[0m[0m metrics_granularity       = "1Minute"
      [32m+[0m[0m min_size                  = 2
      [32m+[0m[0m name                      = (known after apply)
      [32m+[0m[0m name_prefix               = (known after apply)
      [32m+[0m[0m predicted_capacity        = (known after apply)
      [32m+[0m[0m protect_from_scale_in     = false
      [32m+[0m[0m service_linked_role_arn   = (known after apply)
      [32m+[0m[0m target_group_arns         = (known after apply)
      [32m+[0m[0m vpc_zone_identifier       = [
          [32m+[0m[0m "subnet-00cbfefe866668f25",
          [32m+[0m[0m "subnet-0bdaf07c2f06ac225",
        ]
      [32m+[0m[0m wait_for_capacity_timeout = "10m"
      [32m+[0m[0m warm_pool_size            = (known after apply)

      [32m+[0m[0m launch_template {
          [32m+[0m[0m id      = (known after apply)
          [32m+[0m[0m name    = (known after apply)
          [32m+[0m[0m version = "$Default"
        }
    }

[1m  # module.tf-aws-web-tier.aws_launch_template.launch-blueprint[0m will be created
[0m  [32m+[0m[0m resource "aws_launch_template" "launch-blueprint" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_version        = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m image_id               = "ami-06935448000742e6b"
      [32m+[0m[0m instance_type          = "t2.micro"
      [32m+[0m[0m key_name               = "myroku-ssh-pubkey"
      [32m+[0m[0m latest_version         = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "production-hyroku-asg"
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m vpc_security_group_ids = [
          [32m+[0m[0m "sg-06d7bac7cfe77fa20",
        ]
    }

[1m  # module.tf-aws-web-tier.aws_lb.web-lb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "web-lb" {
      [32m+[0m[0m arn                                         = (known after apply)
      [32m+[0m[0m arn_suffix                                  = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                      = "defensive"
      [32m+[0m[0m dns_name                                    = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                  = false
      [32m+[0m[0m enable_deletion_protection                  = false
      [32m+[0m[0m enable_http2                                = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers = false
      [32m+[0m[0m enable_waf_fail_open                        = false
      [32m+[0m[0m enable_xff_client_port                      = false
      [32m+[0m[0m id                                          = (known after apply)
      [32m+[0m[0m idle_timeout                                = 60
      [32m+[0m[0m internal                                    = false
      [32m+[0m[0m ip_address_type                             = (known after apply)
      [32m+[0m[0m load_balancer_type                          = "application"
      [32m+[0m[0m name                                        = "production-hyroku-lb"
      [32m+[0m[0m preserve_host_header                        = false
      [32m+[0m[0m security_groups                             = [
          [32m+[0m[0m "sg-048cf8e55ba9fd02c",
        ]
      [32m+[0m[0m subnets                                     = [
          [32m+[0m[0m "subnet-00cbfefe866668f25",
          [32m+[0m[0m "subnet-0bdaf07c2f06ac225",
        ]
      [32m+[0m[0m tags_all                                    = (known after apply)
      [32m+[0m[0m vpc_id                                      = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                  = "append"
      [32m+[0m[0m zone_id                                     = (known after apply)
    }

[1m  # module.tf-aws-web-tier.aws_lb_listener.web-http-listener[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "web-http-listener" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = (known after apply)
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags_all          = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }
    }

[1m  # module.tf-aws-web-tier.aws_lb_target_group.web-tg[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_target_group" "web-tg" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = false
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = "production-hyroku-tg"
      [32m+[0m[0m port                               = 80
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m target_type                        = "instance"
      [32m+[0m[0m vpc_id                             = "vpc-0c4d6fd51aea11078"
    }

[1mPlan:[0m 6 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @owen-eternal, Action: `pull_request`, Workflow: `Terraform`*